GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32w51x_f5hcp(i)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32-af.h"

/* ADC_IN0 */
#define ADC_IN0_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)

/* ADC_IN1 */
#define ADC_IN1_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)

/* ADC_IN12 */
#define ADC_IN12_PC11 \
	GD32_PINMUX_AF('C', 11, ANALOG)

/* ADC_IN13 */
#define ADC_IN13_PC12 \
	GD32_PINMUX_AF('C', 12, ANALOG)

/* ADC_IN2 */
#define ADC_IN2_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)

/* ADC_IN3 */
#define ADC_IN3_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)

/* ADC_IN4 */
#define ADC_IN4_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)

/* ADC_IN5 */
#define ADC_IN5_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)

/* ADC_IN6 */
#define ADC_IN6_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)

/* ADC_IN7 */
#define ADC_IN7_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)

/* ADC_IN8 */
#define ADC_IN8_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* ANALOG */
#define ANALOG_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)
#define ANALOG_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)
#define ANALOG_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)
#define ANALOG_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)
#define ANALOG_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)
#define ANALOG_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)
#define ANALOG_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)
#define ANALOG_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)
#define ANALOG_PA8 \
	GD32_PINMUX_AF('A', 8, ANALOG)
#define ANALOG_PA9 \
	GD32_PINMUX_AF('A', 9, ANALOG)
#define ANALOG_PA10 \
	GD32_PINMUX_AF('A', 10, ANALOG)
#define ANALOG_PA11 \
	GD32_PINMUX_AF('A', 11, ANALOG)
#define ANALOG_PA12 \
	GD32_PINMUX_AF('A', 12, ANALOG)
#define ANALOG_PA13 \
	GD32_PINMUX_AF('A', 13, ANALOG)
#define ANALOG_PA14 \
	GD32_PINMUX_AF('A', 14, ANALOG)
#define ANALOG_PA15 \
	GD32_PINMUX_AF('A', 15, ANALOG)
#define ANALOG_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)
#define ANALOG_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)
#define ANALOG_PB2 \
	GD32_PINMUX_AF('B', 2, ANALOG)
#define ANALOG_PB3 \
	GD32_PINMUX_AF('B', 3, ANALOG)
#define ANALOG_PB4 \
	GD32_PINMUX_AF('B', 4, ANALOG)
#define ANALOG_PB5 \
	GD32_PINMUX_AF('B', 5, ANALOG)
#define ANALOG_PB6 \
	GD32_PINMUX_AF('B', 6, ANALOG)
#define ANALOG_PB7 \
	GD32_PINMUX_AF('B', 7, ANALOG)
#define ANALOG_PB8 \
	GD32_PINMUX_AF('B', 8, ANALOG)
#define ANALOG_PB9 \
	GD32_PINMUX_AF('B', 9, ANALOG)
#define ANALOG_PB10 \
	GD32_PINMUX_AF('B', 10, ANALOG)
#define ANALOG_PB11 \
	GD32_PINMUX_AF('B', 11, ANALOG)
#define ANALOG_PB12 \
	GD32_PINMUX_AF('B', 12, ANALOG)
#define ANALOG_PB13 \
	GD32_PINMUX_AF('B', 13, ANALOG)
#define ANALOG_PB14 \
	GD32_PINMUX_AF('B', 14, ANALOG)
#define ANALOG_PB15 \
	GD32_PINMUX_AF('B', 15, ANALOG)
#define ANALOG_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)
#define ANALOG_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)
#define ANALOG_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)
#define ANALOG_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)
#define ANALOG_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)
#define ANALOG_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)
#define ANALOG_PC6 \
	GD32_PINMUX_AF('C', 6, ANALOG)
#define ANALOG_PC7 \
	GD32_PINMUX_AF('C', 7, ANALOG)
#define ANALOG_PC8 \
	GD32_PINMUX_AF('C', 8, ANALOG)
#define ANALOG_PC9 \
	GD32_PINMUX_AF('C', 9, ANALOG)
#define ANALOG_PC10 \
	GD32_PINMUX_AF('C', 10, ANALOG)
#define ANALOG_PC11 \
	GD32_PINMUX_AF('C', 11, ANALOG)
#define ANALOG_PC12 \
	GD32_PINMUX_AF('C', 12, ANALOG)
#define ANALOG_PC14 \
	GD32_PINMUX_AF('C', 14, ANALOG)
#define ANALOG_PC15 \
	GD32_PINMUX_AF('C', 15, ANALOG)
#define ANALOG_PD0 \
	GD32_PINMUX_AF('D', 0, ANALOG)
#define ANALOG_PD1 \
	GD32_PINMUX_AF('D', 1, ANALOG)
#define ANALOG_PD2 \
	GD32_PINMUX_AF('D', 2, ANALOG)

/* BOOT0 */
#define BOOT0_PC8 \
	GD32_PINMUX_AF('C', 8, ANALOG)

/* BOOT1 */
#define BOOT1_PA14 \
	GD32_PINMUX_AF('A', 14, ANALOG)

/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AF('A', 8, AF0)

/* CK_OUT1 */
#define CK_OUT1_PC4 \
	GD32_PINMUX_AF('C', 4, AF0)
#define CK_OUT1_PC5 \
	GD32_PINMUX_AF('C', 5, AF0)

/* CTC_SYNC */
#define CTC_SYNC_PA8 \
	GD32_PINMUX_AF('A', 8, AF11)
#define CTC_SYNC_PD2 \
	GD32_PINMUX_AF('D', 2, AF11)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF15)
#define EVENTOUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF15)
#define EVENTOUT_PA2 \
	GD32_PINMUX_AF('A', 2, AF15)
#define EVENTOUT_PA3 \
	GD32_PINMUX_AF('A', 3, AF15)
#define EVENTOUT_PA4 \
	GD32_PINMUX_AF('A', 4, AF15)
#define EVENTOUT_PA5 \
	GD32_PINMUX_AF('A', 5, AF15)
#define EVENTOUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF15)
#define EVENTOUT_PA7 \
	GD32_PINMUX_AF('A', 7, AF15)
#define EVENTOUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF15)
#define EVENTOUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF15)
#define EVENTOUT_PA10 \
	GD32_PINMUX_AF('A', 10, AF15)
#define EVENTOUT_PA11 \
	GD32_PINMUX_AF('A', 11, AF15)
#define EVENTOUT_PA12 \
	GD32_PINMUX_AF('A', 12, AF15)
#define EVENTOUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF15)
#define EVENTOUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF15)
#define EVENTOUT_PA15 \
	GD32_PINMUX_AF('A', 15, AF15)
#define EVENTOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF15)
#define EVENTOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF15)
#define EVENTOUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF15)
#define EVENTOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF15)
#define EVENTOUT_PB4 \
	GD32_PINMUX_AF('B', 4, AF15)
#define EVENTOUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF15)
#define EVENTOUT_PB6 \
	GD32_PINMUX_AF('B', 6, AF15)
#define EVENTOUT_PB7 \
	GD32_PINMUX_AF('B', 7, AF15)
#define EVENTOUT_PB8 \
	GD32_PINMUX_AF('B', 8, AF15)
#define EVENTOUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF15)
#define EVENTOUT_PB10 \
	GD32_PINMUX_AF('B', 10, AF15)
#define EVENTOUT_PB11 \
	GD32_PINMUX_AF('B', 11, AF15)
#define EVENTOUT_PB12 \
	GD32_PINMUX_AF('B', 12, AF15)
#define EVENTOUT_PB13 \
	GD32_PINMUX_AF('B', 13, AF15)
#define EVENTOUT_PB14 \
	GD32_PINMUX_AF('B', 14, AF15)
#define EVENTOUT_PB15 \
	GD32_PINMUX_AF('B', 15, AF15)
#define EVENTOUT_PC0 \
	GD32_PINMUX_AF('C', 0, AF15)
#define EVENTOUT_PC1 \
	GD32_PINMUX_AF('C', 1, AF15)
#define EVENTOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF15)
#define EVENTOUT_PC3 \
	GD32_PINMUX_AF('C', 3, AF15)
#define EVENTOUT_PC4 \
	GD32_PINMUX_AF('C', 4, AF15)
#define EVENTOUT_PC5 \
	GD32_PINMUX_AF('C', 5, AF15)
#define EVENTOUT_PC6 \
	GD32_PINMUX_AF('C', 6, AF15)
#define EVENTOUT_PC7 \
	GD32_PINMUX_AF('C', 7, AF15)
#define EVENTOUT_PC8 \
	GD32_PINMUX_AF('C', 8, AF15)
#define EVENTOUT_PC9 \
	GD32_PINMUX_AF('C', 9, AF15)
#define EVENTOUT_PC10 \
	GD32_PINMUX_AF('C', 10, AF15)
#define EVENTOUT_PC11 \
	GD32_PINMUX_AF('C', 11, AF15)
#define EVENTOUT_PC12 \
	GD32_PINMUX_AF('C', 12, AF15)
#define EVENTOUT_PC14 \
	GD32_PINMUX_AF('C', 14, AF15)
#define EVENTOUT_PC15 \
	GD32_PINMUX_AF('C', 15, AF15)
#define EVENTOUT_PD0 \
	GD32_PINMUX_AF('D', 0, AF15)
#define EVENTOUT_PD1 \
	GD32_PINMUX_AF('D', 1, AF15)
#define EVENTOUT_PD2 \
	GD32_PINMUX_AF('D', 2, AF15)

