GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32w51x_f5hcp(i)xx-pinctrl.h
/* I2C0_SCL */
#define I2C0_SCL_PA15 \
	GD32_PINMUX_AF('A', 15, AF4)
#define I2C0_SCL_PB15 \
	GD32_PINMUX_AF('B', 15, AF4)
#define I2C0_SCL_PC2 \
	GD32_PINMUX_AF('C', 2, AF4)
#define I2C0_SCL_PD2 \
	GD32_PINMUX_AF('D', 2, AF5)

/* I2C0_SDA */
#define I2C0_SDA_PA8 \
	GD32_PINMUX_AF('A', 8, AF5)
#define I2C0_SDA_PA14 \
	GD32_PINMUX_AF('A', 14, AF12)
#define I2C0_SDA_PB7 \
	GD32_PINMUX_AF('B', 7, AF4)
#define I2C0_SDA_PC3 \
	GD32_PINMUX_AF('C', 3, AF4)
#define I2C0_SDA_PC8 \
	GD32_PINMUX_AF('C', 8, AF5)
#define I2C0_SDA_PD1 \
	GD32_PINMUX_AF('D', 1, AF5)

/* I2C0_SMBA */
#define I2C0_SMBA_PA13 \
	GD32_PINMUX_AF('A', 13, AF4)
#define I2C0_SMBA_PC0 \
	GD32_PINMUX_AF('C', 0, AF4)
#define I2C0_SMBA_PD0 \
	GD32_PINMUX_AF('D', 0, AF5)

/* I2C1_SCL */
#define I2C1_SCL_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)
#define I2C1_SCL_PB15 \
	GD32_PINMUX_AF('B', 15, AF6)
#define I2C1_SCL_PC3 \
	GD32_PINMUX_AF('C', 3, AF6)

/* I2C1_SDA */
#define I2C1_SDA_PA8 \
	GD32_PINMUX_AF('A', 8, AF6)
#define I2C1_SDA_PC2 \
	GD32_PINMUX_AF('C', 2, AF9)
#define I2C1_SDA_PC8 \
	GD32_PINMUX_AF('C', 8, AF6)

/* I2C1_SMBA */
#define I2C1_SMBA_PA14 \
	GD32_PINMUX_AF('A', 14, AF4)
#define I2C1_SMBA_PC1 \
	GD32_PINMUX_AF('C', 1, AF4)

/* I2S1_ADD_SD */
#define I2S1_ADD_SD_PA4 \
	GD32_PINMUX_AF('A', 4, AF1)
#define I2S1_ADD_SD_PB14 \
	GD32_PINMUX_AF('B', 14, AF6)
#define I2S1_ADD_SD_PC2 \
	GD32_PINMUX_AF('C', 2, AF6)
#define I2S1_ADD_SD_PC4 \
	GD32_PINMUX_AF('C', 4, AF1)

/* I2S1_CKIN */
#define I2S1_CKIN_PA2 \
	GD32_PINMUX_AF('A', 2, AF5)
#define I2S1_CKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF4)
#define I2S1_CKIN_PB11 \
	GD32_PINMUX_AF('B', 11, AF5)
#define I2S1_CKIN_PC11 \
	GD32_PINMUX_AF('C', 11, AF6)

/* I2S1_MCK */
#define I2S1_MCK_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)
#define I2S1_MCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF2)
#define I2S1_MCK_PA6 \
	GD32_PINMUX_AF('A', 6, AF6)
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AF('C', 6, AF5)
#define I2S1_MCK_PD1 \
	GD32_PINMUX_AF('D', 1, AF6)

/* I2S1_SD */
#define I2S1_SD_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define I2S1_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF13)
#define I2S1_SD_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define I2S1_SD_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define I2S1_SD_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define I2S1_SD_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)
#define I2S1_SD_PD0 \
	GD32_PINMUX_AF('D', 0, AF9)

/* I2S1_WS */
#define I2S1_WS_PA7 \
	GD32_PINMUX_AF('A', 7, AF0)
#define I2S1_WS_PB6 \
	GD32_PINMUX_AF('B', 6, AF13)
#define I2S1_WS_PB7 \
	GD32_PINMUX_AF('B', 7, AF5)
#define I2S1_WS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)
#define I2S1_WS_PC12 \
	GD32_PINMUX_AF('C', 12, AF9)
#define I2S1_WS_PD1 \
	GD32_PINMUX_AF('D', 1, AF9)

/* IFRP_OUT */
#define IFRP_OUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF0)
#define IFRP_OUT_PB10 \
	GD32_PINMUX_AF('B', 10, AF9)
#define IFRP_OUT_PB15 \
	GD32_PINMUX_AF('B', 15, AF9)
#define IFRP_OUT_PC15 \
	GD32_PINMUX_AF('C', 15, AF0)
#define IFRP_OUT_PD2 \
	GD32_PINMUX_AF('D', 2, AF0)

/* JTCK */
#define JTCK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* JTDI */
#define JTDI_PA15 \
	GD32_PINMUX_AF('A', 15, AF0)

/* JTDO */
#define JTDO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* JTMS */
#define JTMS_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* NJTRST */
#define NJTRST_PB4 \
	GD32_PINMUX_AF('B', 4, AF0)

/* OSC32IN */
#define OSC32IN_PC14 \
	GD32_PINMUX_AF('C', 14, ANALOG)

/* OSC32OUT */
#define OSC32OUT_PC15 \
	GD32_PINMUX_AF('C', 15, ANALOG)

/* OSCIN */
#define OSCIN_PC9 \
	GD32_PINMUX_AF('C', 9, ANALOG)

/* OSCOUT */
#define OSCOUT_PC10 \
	GD32_PINMUX_AF('C', 10, ANALOG)

/* QSPI_CSN */
#define QSPI_CSN_PA5 \
	GD32_PINMUX_AF('A', 5, AF3)
#define QSPI_CSN_PA10 \
	GD32_PINMUX_AF('A', 10, AF4)
#define QSPI_CSN_PC12 \
	GD32_PINMUX_AF('C', 12, AF3)

/* QSPI_IO0 */
#define QSPI_IO0_PA6 \
	GD32_PINMUX_AF('A', 6, AF3)
#define QSPI_IO0_PA11 \
	GD32_PINMUX_AF('A', 11, AF4)

/* QSPI_IO1 */
#define QSPI_IO1_PA7 \
	GD32_PINMUX_AF('A', 7, AF3)
#define QSPI_IO1_PA12 \
	GD32_PINMUX_AF('A', 12, AF4)
#define QSPI_IO1_PD0 \
	GD32_PINMUX_AF('D', 0, AF3)

/* QSPI_IO2 */
#define QSPI_IO2_PB3 \
	GD32_PINMUX_AF('B', 3, AF3)
#define QSPI_IO2_PC4 \
	GD32_PINMUX_AF('C', 4, AF3)
#define QSPI_IO2_PD1 \
	GD32_PINMUX_AF('D', 1, AF3)

/* QSPI_IO3 */
#define QSPI_IO3_PB4 \
	GD32_PINMUX_AF('B', 4, AF3)
#define QSPI_IO3_PC5 \
	GD32_PINMUX_AF('C', 5, AF3)
#define QSPI_IO3_PD2 \
	GD32_PINMUX_AF('D', 2, AF3)

/* QSPI_SCK */
#define QSPI_SCK_PA4 \
	GD32_PINMUX_AF('A', 4, AF3)
#define QSPI_SCK_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)
#define QSPI_SCK_PC11 \
	GD32_PINMUX_AF('C', 11, AF3)

/* RTC_OUT */
#define RTC_OUT_PA3 \
	GD32_PINMUX_AF('A', 3, AF9)
#define RTC_OUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF9)
#define RTC_OUT_PC15 \
	GD32_PINMUX_AF('C', 15, ANALOG)
#define RTC_OUT_PD2 \
	GD32_PINMUX_AF('D', 2, AF6)

/* RTC_REFIN */
#define RTC_REFIN_PB15 \
	GD32_PINMUX_AF('B', 15, AF0)

/* RTC_TAMP0 */
#define RTC_TAMP0_PC15 \
	GD32_PINMUX_AF('C', 15, ANALOG)

/* RTC_TAMP1 */
#define RTC_TAMP1_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)

/* RTC_TS */
#define RTC_TS_PC15 \
	GD32_PINMUX_AF('C', 15, ANALOG)

/* SPI0_IO2 */
#define SPI0_IO2_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define SPI0_IO2_PC4 \
	GD32_PINMUX_AF('C', 4, AF6)
#define SPI0_IO2_PC6 \
	GD32_PINMUX_AF('C', 6, AF12)
#define SPI0_IO2_PD1 \
	GD32_PINMUX_AF('D', 1, AF4)

/* SPI0_IO3 */
#define SPI0_IO3_PB4 \
	GD32_PINMUX_AF('B', 4, AF6)
#define SPI0_IO3_PC5 \
	GD32_PINMUX_AF('C', 5, AF6)
#define SPI0_IO3_PC7 \
	GD32_PINMUX_AF('C', 7, AF12)
#define SPI0_IO3_PD2 \
	GD32_PINMUX_AF('D', 2, AF4)

/* SPI0_MISO */
#define SPI0_MISO_PA5 \
	GD32_PINMUX_AF('A', 5, AF4)
#define SPI0_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define SPI0_MISO_PA10 \
	GD32_PINMUX_AF('A', 10, AF0)
#define SPI0_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF5)

/* SPI0_MOSI */
#define SPI0_MOSI_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define SPI0_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)
#define SPI0_MOSI_PA9 \
	GD32_PINMUX_AF('A', 9, AF0)
#define SPI0_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)
#define SPI0_MOSI_PD0 \
	GD32_PINMUX_AF('D', 0, AF4)

/* SPI0_NSS */
#define SPI0_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define SPI0_NSS_PA7 \
	GD32_PINMUX_AF('A', 7, AF4)
#define SPI0_NSS_PA12 \
	GD32_PINMUX_AF('A', 12, AF6)
#define SPI0_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)
#define SPI0_NSS_PC12 \
	GD32_PINMUX_AF('C', 12, AF4)

/* SPI0_SCK */
#define SPI0_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define SPI0_SCK_PA6 \
	GD32_PINMUX_AF('A', 6, AF7)
#define SPI0_SCK_PA11 \
	GD32_PINMUX_AF('A', 11, AF0)
#define SPI0_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF5)
#define SPI0_SCK_PC11 \
	GD32_PINMUX_AF('C', 11, AF4)

/* SPI1_MISO */
#define SPI1_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF13)
#define SPI1_MISO_PB6 \
	GD32_PINMUX_AF('B', 6, AF5)
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AF('B', 14, AF5)
#define SPI1_MISO_PC2 \
	GD32_PINMUX_AF('C', 2, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define SPI1_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF13)
#define SPI1_MOSI_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define SPI1_MOSI_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define SPI1_MOSI_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)
#define SPI1_MOSI_PD0 \
	GD32_PINMUX_AF('D', 0, AF9)

