GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32w51x_f5hcp(i)xx-pinctrl.h
/* SPI1_NSS */
#define SPI1_NSS_PA7 \
	GD32_PINMUX_AF('A', 7, AF0)
#define SPI1_NSS_PB6 \
	GD32_PINMUX_AF('B', 6, AF13)
#define SPI1_NSS_PB7 \
	GD32_PINMUX_AF('B', 7, AF5)
#define SPI1_NSS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)
#define SPI1_NSS_PC12 \
	GD32_PINMUX_AF('C', 12, AF9)
#define SPI1_NSS_PD1 \
	GD32_PINMUX_AF('D', 1, AF9)

/* SPI1_SCK */
#define SPI1_SCK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define SPI1_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF13)
#define SPI1_SCK_PB8 \
	GD32_PINMUX_AF('B', 8, AF5)
#define SPI1_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define SPI1_SCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF5)
#define SPI1_SCK_PC11 \
	GD32_PINMUX_AF('C', 11, AF9)
#define SPI1_SCK_PD2 \
	GD32_PINMUX_AF('D', 2, AF9)

/* SQPI_CLK */
#define SQPI_CLK_PA9 \
	GD32_PINMUX_AF('A', 9, AF3)
#define SQPI_CLK_PC4 \
	GD32_PINMUX_AF('C', 4, AF8)

/* SQPI_CSN */
#define SQPI_CSN_PA10 \
	GD32_PINMUX_AF('A', 10, AF3)
#define SQPI_CSN_PB6 \
	GD32_PINMUX_AF('B', 6, AF12)
#define SQPI_CSN_PC5 \
	GD32_PINMUX_AF('C', 5, AF8)
#define SQPI_CSN_PC12 \
	GD32_PINMUX_AF('C', 12, AF8)

/* SQPI_D0 */
#define SQPI_D0_PA11 \
	GD32_PINMUX_AF('A', 11, AF3)
#define SQPI_D0_PC6 \
	GD32_PINMUX_AF('C', 6, AF13)

/* SQPI_D1 */
#define SQPI_D1_PA12 \
	GD32_PINMUX_AF('A', 12, AF8)
#define SQPI_D1_PC7 \
	GD32_PINMUX_AF('C', 7, AF13)
#define SQPI_D1_PD0 \
	GD32_PINMUX_AF('D', 0, AF8)

/* SQPI_D2 */
#define SQPI_D2_PB3 \
	GD32_PINMUX_AF('B', 3, AF8)
#define SQPI_D2_PD1 \
	GD32_PINMUX_AF('D', 1, AF8)

/* SQPI_D3 */
#define SQPI_D3_PB4 \
	GD32_PINMUX_AF('B', 4, AF8)
#define SQPI_D3_PD2 \
	GD32_PINMUX_AF('D', 2, AF8)

/* SQPI_SCK */
#define SQPI_SCK_PB5 \
	GD32_PINMUX_AF('B', 5, AF12)
#define SQPI_SCK_PC11 \
	GD32_PINMUX_AF('C', 11, AF8)

/* SWCLK */
#define SWCLK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* SWDIO */
#define SWDIO_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PB12 \
	GD32_PINMUX_AF('B', 12, AF1)
#define TIMER0_BRKIN_PC1 \
	GD32_PINMUX_AF('C', 1, AF1)
#define TIMER0_BRKIN_PC6 \
	GD32_PINMUX_AF('C', 6, AF1)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF6)
#define TIMER0_CH0_PA8 \
	GD32_PINMUX_AF('A', 8, AF1)
#define TIMER0_CH0_PC2 \
	GD32_PINMUX_AF('C', 2, AF1)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PA3 \
	GD32_PINMUX_AF('A', 3, AF8)
#define TIMER0_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TIMER0_CH0_ON_PB13 \
	GD32_PINMUX_AF('B', 13, AF1)
#define TIMER0_CH0_ON_PC3 \
	GD32_PINMUX_AF('C', 3, AF8)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA4 \
	GD32_PINMUX_AF('A', 4, AF8)
#define TIMER0_CH1_PA6 \
	GD32_PINMUX_AF('A', 6, AF8)
#define TIMER0_CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF1)
#define TIMER0_CH1_PB10 \
	GD32_PINMUX_AF('B', 10, AF8)
#define TIMER0_CH1_PC6 \
	GD32_PINMUX_AF('C', 6, AF8)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PA5 \
	GD32_PINMUX_AF('A', 5, AF8)
#define TIMER0_CH1_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF6)
#define TIMER0_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF1)
#define TIMER0_CH1_ON_PB11 \
	GD32_PINMUX_AF('B', 11, AF2)
#define TIMER0_CH1_ON_PB14 \
	GD32_PINMUX_AF('B', 14, AF1)
#define TIMER0_CH1_ON_PC7 \
	GD32_PINMUX_AF('C', 7, AF3)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF1)
#define TIMER0_CH2_ON_PB15 \
	GD32_PINMUX_AF('B', 15, AF1)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11 \
	GD32_PINMUX_AF('A', 11, AF1)
#define TIMER0_CH3_PB12 \
	GD32_PINMUX_AF('B', 12, AF2)
#define TIMER0_CH3_PC0 \
	GD32_PINMUX_AF('C', 0, AF2)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12 \
	GD32_PINMUX_AF('A', 12, AF1)
#define TIMER0_ETI_PC2 \
	GD32_PINMUX_AF('C', 2, AF0)
#define TIMER0_ETI_PC7 \
	GD32_PINMUX_AF('C', 7, AF0)

/* TIMER15_BRKIN */
#define TIMER15_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF12)
#define TIMER15_BRKIN_PB3 \
	GD32_PINMUX_AF('B', 3, AF11)
#define TIMER15_BRKIN_PB14 \
	GD32_PINMUX_AF('B', 14, AF8)
#define TIMER15_BRKIN_PC3 \
	GD32_PINMUX_AF('C', 3, AF12)

/* TIMER15_CH0 */
#define TIMER15_CH0_PA4 \
	GD32_PINMUX_AF('A', 4, AF12)
#define TIMER15_CH0_PA8 \
	GD32_PINMUX_AF('A', 8, AF8)
#define TIMER15_CH0_PB13 \
	GD32_PINMUX_AF('B', 13, AF8)

/* TIMER15_CH0_ON */
#define TIMER15_CH0_ON_PA5 \
	GD32_PINMUX_AF('A', 5, AF12)
#define TIMER15_CH0_ON_PA9 \
	GD32_PINMUX_AF('A', 9, AF8)

/* TIMER16_BRKIN */
#define TIMER16_BRKIN_PA11 \
	GD32_PINMUX_AF('A', 11, AF7)
#define TIMER16_BRKIN_PC6 \
	GD32_PINMUX_AF('C', 6, AF7)
#define TIMER16_BRKIN_PD0 \
	GD32_PINMUX_AF('D', 0, AF12)

/* TIMER16_CH0 */
#define TIMER16_CH0_PA10 \
	GD32_PINMUX_AF('A', 10, AF7)
#define TIMER16_CH0_PC7 \
	GD32_PINMUX_AF('C', 7, AF7)
#define TIMER16_CH0_PD1 \
	GD32_PINMUX_AF('D', 1, AF12)

/* TIMER16_CH0_ON */
#define TIMER16_CH0_ON_PA12 \
	GD32_PINMUX_AF('A', 12, AF10)
#define TIMER16_CH0_ON_PC5 \
	GD32_PINMUX_AF('C', 5, AF12)
#define TIMER16_CH0_ON_PD2 \
	GD32_PINMUX_AF('D', 2, AF12)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF1)
#define TIMER1_CH0_PC3 \
	GD32_PINMUX_AF('C', 3, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER1_CH1_PA6 \
	GD32_PINMUX_AF('A', 6, AF9)
#define TIMER1_CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)
#define TIMER1_CH1_PB9 \
	GD32_PINMUX_AF('B', 9, AF1)
#define TIMER1_CH1_PC6 \
	GD32_PINMUX_AF('C', 6, AF9)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)
#define TIMER1_CH2_PA7 \
	GD32_PINMUX_AF('A', 7, AF9)
#define TIMER1_CH2_PB10 \
	GD32_PINMUX_AF('B', 10, AF1)
#define TIMER1_CH2_PC7 \
	GD32_PINMUX_AF('C', 7, AF9)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)
#define TIMER1_CH3_PB2 \
	GD32_PINMUX_AF('B', 2, AF1)
#define TIMER1_CH3_PB5 \
	GD32_PINMUX_AF('B', 5, AF1)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_ETI_PB4 \
	GD32_PINMUX_AF('B', 4, AF1)
#define TIMER1_ETI_PC3 \
	GD32_PINMUX_AF('C', 3, AF1)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER2_CH0_PC5 \
	GD32_PINMUX_AF('C', 5, AF1)
#define TIMER2_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF2)
#define TIMER2_CH0_PD0 \
	GD32_PINMUX_AF('D', 0, AF10)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)
#define TIMER2_CH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)
#define TIMER2_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF2)
#define TIMER2_CH1_PD1 \
	GD32_PINMUX_AF('D', 1, AF10)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF3)
#define TIMER2_CH2_PC4 \
	GD32_PINMUX_AF('C', 4, AF2)
#define TIMER2_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)
#define TIMER2_CH2_PD2 \
	GD32_PINMUX_AF('D', 2, AF10)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB2 \
	GD32_PINMUX_AF('B', 2, AF3)
#define TIMER2_CH3_PC5 \
	GD32_PINMUX_AF('C', 5, AF2)

/* TIMER3_CH0 */
#define TIMER3_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF12)
#define TIMER3_CH0_PB0 \
	GD32_PINMUX_AF('B', 0, AF3)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB2 \
	GD32_PINMUX_AF('B', 2, AF2)
#define TIMER3_CH2_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)

